//=============================================================================
//
// スコア処理 [score.h]
// Author : 白井陽大
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
static const int SCORE_MAX	 = 99999;		// スコアの最大値
static const int SCORE_DIGIT = 4;			// 桁数
static const int SCORE_GAIN_DIGIT = 3;		// 獲得したスコアの桁数
static const int SCORE_POINT = 100;			// 獲得スコア


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitScore(void);
void UninitScore(void);
void UpdateScore(void);
void DrawScore(void);

void AddScore(int add);
int GetScore(void);


