//=============================================================================
//
// エピローグ画面処理 [epilogue.h]
// Author : 白井陽大
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************




//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEpilogue(void);
void UninitEpilogue(void);
void UpdateEpilogue(void);
void DrawEpilogue(void);

BOOL GetEpilogueFlg(void);
void SetEpilogueFlg(BOOL epilogueFlg);
