//=============================================================================
//
// ファイル処理 [file.h]
// Author : 白井陽大
//
//=============================================================================
#pragma once

#include "main.h"
#include "player.h"
#include "enemy.h"
#include "field.h"
#include "score.h"
#include "settings.h"
#include "sound.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/



/*******************************************************************************
* 構造体定義
*******************************************************************************/
class	SAVEDATA				// セーブデータの構造体
{
public:
	// プレイヤーデータを保存
	PLAYER	player[PLAYER_MAX];	// プレイヤーのMAX人数分セーブする

	// エネミーデータを保存
	ENEMY	enemy[ENEMY_MAX];	// エネミーのMAX人数分セーブする

	// スコアデータを保存
	int		score;				// スコアを保存する

	// 他にも何かセーブしたい物があればここに追加

	int		sum;				// チェックサムを入れる
};

class SETTINGSDATA		// 設定情報の構造体
{
public:
	// 設定情報を保存
	float volume;	// サウンドの音量
	int volumeNum;	// サウンドの見た目上の音量
	//float seVolume[SOUND_LABEL_MAX];	// サウンドの音量
};

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void SaveData(void);
void LoadData(void);
void SaveSettings(void);
void LoadSettings(void);
//void LoadField(void);
int CheckSettingsFile();


