//=============================================================================
//
// プロローグ画面処理 [prologue.h]
// Author : 白井陽大
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"
#include "debugproc.h"
#include "sprite.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************




//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPrologue(void);
void UninitPrologue(void);
void UpdatePrologue(void);
void DrawPrologue(void);

BOOL GetPrologueFlg(void);
void SetPrologueFlg(BOOL prologueFlg);
